datasync.xml

 <?xml version="1.0" encoding="utf-8" ?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><ns1:syncOrderRelation xmlns:ns1="http://www.csapi.org/schema/parlayx/data/sync/v1_0/local"><ns1:userID><ID>639461214997</ID><type>0</type></ns1:userID><ns1:spID>002800</ns1:spID><ns1:productID>1000010297</ns1:productID><ns1:serviceID>11000049</ns1:serviceID><ns1:serviceList>11000049</ns1:serviceList><ns1:updateType>3</ns1:updateType><ns1:updateTime>20160703155613</ns1:updateTime><ns1:updateDesc>Modification</ns1:updateDesc><ns1:effectiveTime>20160623124112</ns1:effectiveTime><ns1:expiryTime>20361231160000</ns1:expiryTime><ns1:extensionInfo><item><key>Starttime</key><value>20160702160000</value></item><item><key>cycleEndTime</key><value>20160703160000</value></item><item><key>lastRenewTime</key><value>20160703155447</value></item><item><key>servicePayType</key><value>0</value></item><item><key>durationOfGracePeriod</key><value>0</value></item><item><key>serviceAvailability</key><value>0</value></item><item><key>NotifyType</key><value>RentNotify</value></item><item><key>payType</key><value>1</value></item><item><key>transactionID</key><value>1465232194919</value></item><item><key>orderKey</key><value>999000000102291161</value></item><item><key>accessCode</key><value>8950</value></item><item><key>chargeMode</key><value>18</value></item><item><key>MDSPSUBEXPMODE</key><value>1</value></item><item><key>objectType</key><value>1</value></item><item><key>status</key><value>0</value></item><item><key>feeWithoutTax</key><value>0</value></item><item><key>microbillingFlag</key><value>0</value></item><item><key>TraceUniqueID</key><value>000000404571607031556133321001</value></item><item><key>channelID</key><value>100</value></item><item><key>cycleStartTime</key><value>20160702160000</value></item><item><key>messageID</key><value>b24f33b5cdcb4a45aaf002c0a9ac421b</value></item><item><key>rentSuccess</key><value>true</value></item><item><key>try</key><value>false</value></item></ns1:extensionInfo></ns1:syncOrderRelation></soapenv:Body></soapenv:Envelope>